In [2]:
#Initialising the needed libaries
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns 
import matplotlib.pyplot as plt

In [67]:

# Define a dictionary containing Students data
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj','Peter'],
        'Height': [5.1, 6.2, 5.1, 5.2, 7.9],
        'Qualification1': ['Msc', 'MA', 'Msc', 'Msc','MA'],
        'Qualification2': ['MA', 'MA', 'Msc', 'MA','02']}
  
# Convert the dictionary into DataFrame
df = pd.DataFrame(data)
df

     Name  Height Qualification1 Qualification2
0     Jai     5.1            Msc             MA
1  Princi     6.2             MA             MA
2  Gaurav     5.1            Msc            Msc
3    Anuj     5.2            Msc             MA
4   Peter     7.9             MA             02

In [47]:
unione=(set(uni_val) | set(uni_val2))
unione

{'MA', 'Msc'}

In [23]:
list=["Msc","MA"]

In [68]:
x=1
uni_val=[]
while x<3:
    templist=df[("Qualification"+str(x))].unique().tolist()
    uni_val.append(templist)
    print(uni_val)
    x=x+1
print("Dies ist die Endliste: ")
print(uni_val)
print("Dies ist die Endliste mit nur unique Values: ")
endlist=sorted(np.unique(uni_val))
endlist

[['Msc', 'MA']]
[['Msc', 'MA'], ['MA', 'Msc', '02']]
Dies ist die Endliste:
[['Msc', 'MA'], ['MA', 'Msc', '02']]
Dies ist die Endliste mit nur unique Values:

c:\Users\Marek\anaconda3\lib\site-packages\numpy\core\_asarray.py:171: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  return array(a, dtype, copy=False, order=order, subok=True)

[['MA', 'Msc', '02'], ['Msc', 'MA']]

In [36]:
uni_val=df[("Qualification")].unique().tolist()
uni_val

['Msc', 'MA']

In [54]:
x=2
uni_val2=df[("Qualification2")].unique().tolist()
uni_val2

SyntaxError: cannot assign to function call (Temp/ipykernel_2644/943801970.py, line 2)

In [62]:
endlist=sorted(np.unique(uni_val))
endlist

['MA', 'Msc']

In [52]:
endlist[0]

'MA'

In [53]:
msc_df=df[(df["Qualification"]==endlist[1]) | (df["Qualification2"]==endlist[1])]
msc_df

     Name  Height Qualification Qualification2
0     Jai     5.1           Msc             MA
2  Gaurav     5.1           Msc            Msc
3    Anuj     5.2           Msc             MA
4   Peter     7.9            MA            Msc

In [17]:
msc_df["Height"].median()

5.15

In [3]:
#Msc als Missingvalue setzen
df["Qualification"]=df["Qualification"].replace("Msc", np.nan)
df

     Name  Height Qualification
0     Jai     5.1           NaN
1  Princi     6.2            MA
2  Gaurav     5.1           NaN
3    Anuj     5.2           NaN
4   Peter     7.9            MA

In [4]:
df["count"]=0
df

     Name  Height Qualification  count
0     Jai     5.1           NaN      0
1  Princi     6.2            MA      0
2  Gaurav     5.1           NaN      0
3    Anuj     5.2           NaN      0
4   Peter     7.9            MA      0

In [63]:
df.loc[(df["Name"].notnull()), "count"]=1
df

     Name  Height Qualification count
0     Jai     5.1           NaN     1
1  Princi     6.2            MA     1
2  Gaurav     5.1           NaN     1
3    Anuj     5.2           NaN     1
4   Peter     7.9            MA     1

In [64]:
df.loc[(df["Qualification"].notnull()), "count"]=2
df

     Name  Height Qualification count
0     Jai     5.1           NaN     1
1  Princi     6.2            MA     2
2  Gaurav     5.1           NaN     1
3    Anuj     5.2           NaN     1
4   Peter     7.9            MA     2

In [61]:
nomissing=df[df["Qualification"].notnull()]
nomissing

     Name  Height Qualification count
1  Princi     6.2            MA     M
4   Peter     7.9            MA     M

In [59]:
nomissing["count"]=2
nomissing

C:\Users\Marek\AppData\Local\Temp/ipykernel_16444/3140169055.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nomissing["count"]=2

     Name  Height Qualification  count
1  Princi     6.2            MA      2
4   Peter     7.9            MA      2

In [47]:
df["count"] = df["Name"].str.extract("([a-zA-ZüäöÖÄÜ])")
df["count"] = df["count"].str.replace("[a-zA-ZüäöÖÄÜ]", "1")
df

C:\Users\Marek\AppData\Local\Temp/ipykernel_16444/1184346175.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  df["count"] = df["count"].str.replace("[a-zA-ZüäöÖÄÜ]", "1")

     Name  Height Qualification count
0     Jai     5.1           NaN     1
1  Princi     6.2            MA     1
2  Gaurav     5.1           NaN     1
3    Anuj     5.2           NaN     1
4   Peter     7.9            MA     1

In [48]:
df["count"]=df["count"].astype("int")
df["count"].astype

<bound method NDFrame.astype of 0    1
1    1
2    1
3    1
4    1
Name: count, dtype: int32>

In [49]:
df

     Name  Height Qualification  count
0     Jai     5.1           NaN      1
1  Princi     6.2            MA      1
2  Gaurav     5.1           NaN      1
3    Anuj     5.2           NaN      1
4   Peter     7.9            MA      1

In [50]:

df["count"] = df["Qualification"].str.extract("([a-zA-ZüäöÖÄÜ])")
#df["count"] = df["count"].str.replace("[a-zA-ZüäöÖÄÜ]", 2)
df

     Name  Height Qualification count
0     Jai     5.1           NaN   NaN
1  Princi     6.2            MA     M
2  Gaurav     5.1           NaN   NaN
3    Anuj     5.2           NaN   NaN
4   Peter     7.9            MA     M

In [24]:
df

     Name  Height Qualification count
0     Jai     5.1           NaN   NaN
1  Princi     6.2            MA     2
2  Gaurav     5.1           NaN   NaN
3    Anuj     5.2           NaN   NaN
4   Peter     7.9            MA     2

In [42]:
df[df["Qualification"].notnull()].sum(axis=1)
df

C:\Users\Marek\AppData\Local\Temp/ipykernel_5544/1132164082.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[df["Qualification"].notnull()].sum(axis=1).bool

     Name  Height Qualification  count
0     Jai     5.1           NaN      1
1  Princi     6.2            MA      1
2  Gaurav     5.1           NaN      1
3    Anuj     5.2           NaN      1
4   Peter     7.9            MA      1

In [68]:
n=0
r=0
if df["Qualification"].not is True:
    df.loc["count"]=2

SyntaxError: invalid syntax (Temp/ipykernel_5544/377665204.py, line 3)

In [70]:
df.loc["count"]=2
df

         Name  Height Qualification  count
0         Jai     5.1           NaN      0
1      Princi     6.2            MA      0
2      Gaurav     5.1           NaN      0
3        Anuj     5.2           NaN      0
4       Peter     7.9            MA      0
count       2     2.0             2      2

In [34]:
def countrow_add():
    df["count"]=1

In [46]:
df.loc[1,"count"]=1
df

     Name  Height Qualification  count
0     Jai     5.1           NaN      0
1  Princi     6.2            MA      1
2  Gaurav     5.1           NaN      0
3    Anuj     5.2           NaN      0
4   Peter     7.9            MA      0

In [72]:
dp=df[df["Qualification"].notnull()]
dp

         Name  Height Qualification  count
1      Princi     6.2            MA      0
4       Peter     7.9            MA      0
count       2     2.0             2      2

In [79]:
dp["count"] = 1
dp

C:\Users\Marek\AppData\Local\Temp/ipykernel_5544/792937895.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dp["count"] = 1

         Name  Height Qualification  count
1      Princi     6.2            MA      1
4       Peter     7.9            MA      1
count       2     2.0             2      1

In [81]:
dp_merge=dp["count"]
dp_merge

1        1
4        1
count    1
Name: count, dtype: int64

In [95]:
new=dp.join(df, on="count")
new

ValueError: columns overlap but no suffix specified: Index(['Name', 'Height', 'Qualification', 'count'], dtype='object')

In [97]:
test=df.copy()
test[test["Qualification"].notnull()]

         Name  Height Qualification  count
0         Jai     5.1           NaN      0
1      Princi     6.2            MA      0
2      Gaurav     5.1           NaN      0
3        Anuj     5.2           NaN      0
4       Peter     7.9            MA      0
count       2     2.0             2      2

In [99]:
test["Qualification"].notnull().replace()

0        False
1         True
2        False
3        False
4         True
count     True
Name: Qualification, dtype: bool

In [ ]:
test

In [84]:
df

         Name  Height Qualification  count
0         Jai     5.1           NaN      0
1      Princi     6.2            MA      0
2      Gaurav     5.1           NaN      0
3        Anuj     5.2           NaN      0
4       Peter     7.9            MA      0
count       2     2.0             2      2

In [58]:
df.iloc[1,2].notnull()

AttributeError: 'str' object has no attribute 'notnull'

In [4]:
df["Qualification"].apply(len)

0    3
1    2
2    3
3    3
Name: Qualification, dtype: int64

In [59]:
df["count"].notnull()

0    True
1    True
2    True
3    True
4    True
Name: count, dtype: bool

In [14]:
df["Qualification"]=df["Qualification"].replace("Msc", np.nan)

In [15]:
df

     Name  Height Qualification  count Qualificaion
0     Jai     5.1           NaN    NaN          NaN
1  Princi     6.2            MA    NaN           MA
2  Gaurav     5.1           NaN    NaN          NaN
3    Anuj     5.2           NaN    NaN          NaN